prometheus_tech.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>prometheus-tech</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<div id="outline-container-org7311a9c" class="outline-2">
<h2 id="org7311a9c">prometheus</h2>
<div class="outline-text-2" id="text-org7311a9c">
</div>
<div id="outline-container-orge00edca" class="outline-3">
<h3 id="orge00edca">prometheus/grafana/node<sub>exporter</sub></h3>
<div class="outline-text-3" id="text-orge00edca">
<ul class="org-ul">
<li>grafana standalone oss, port 3000, node<sub>exporter</sub> dashboard: <a href="https://grafana.com/grafana/dashboards/1860">https://grafana.com/grafana/dashboards/1860</a> , import datasource first</li>
<li>node<sub>exporter</sub> from prometheus or cloudflare for ebpf, port 9100</li>
<li>prometheus &#x2013;config.file=thing.yaml, port 9090,</li>
<li>prometheus.yaml</li>
</ul>
<p>
global:
  scrape<sub>interval</sub>: 15s
scrape<sub>configs</sub>:
</p>
<ul class="org-ul">
<li>job<sub>name</sub>: node
static<sub>configs</sub>:
<ul class="org-ul">
<li>targets: ['localhost:9100']</li>
</ul></li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
